app/controllers/musics_controller.rb

    def show
        @music = Music.find(params[:id])

        @user = User.find(@music.user_id)
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]

    def create
        @music = current_user.musics.build(music_params)

        if @music.save
---
INSERT INTO "musics" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-08-19 10:44:20.383139"], ["updated_at", "2018-08-19 10:44:20.383139"]]

    def edit
      @music = Music.find(params[:id])
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT 1  [["id", 5]]

    def update
      @music = Music.find(params[:id])

      if @music.update(music_params)
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "musics" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "musics"."id" = ?  [["title", "Rap 123"], ["description", "first rap song"], ["updated_at", "2018-08-19 11:54:29.813778"], ["id", 5]]

    def destroy
      @music = Music.find(params[:id])
      @user = User.find( @music.user_id)

      @music.destroy
---
SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
DELETE FROM "musics" WHERE "musics"."id" = ?  [["id", 2]]