app/controllers/pages_controller.rb

SELECT "musics".* FROM "musics"
---
    def home
        @musics = Music.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "musics".* FROM "musics" WHERE (user_id = 2)
---
    def profile
        @user = User.find(params[:id])

        @musics = Music.where("user_id = ?", @user.id)